const questions = [
    {
      question: "中国先秦墨家学派的创始人_________是中国战国时期著名的思想家。墨家思想的核心是“兼相爱、交相利”，反对恃强凌弱，主张平等兼爱。",
      options: [" 庄子", " 老子", " 韩非子", " 墨子"],
      correctAnswer: 3
    },
    {
      question: "北京的故宫，这座_________两朝的皇宫是目前世界上最大的木结构建筑群。",
      options: [" 唐宋", " 宋元", " 明清", " 隋唐"],
      correctAnswer: 2
    },
    {
      question: "中国是世界文明古国之一，指南针、造纸术、印刷术和_________这“四大发明”展现了中国古代灿烂的科技文化。",
      options: [" 日晷", " 地动仪", " 火药", " 针灸"],
      correctAnswer: 2
    },
    {
      question: "下列简称中不规范的是：",
      options: [" 中国工商银行——工行", " 现代汉语—— 现汉", " 冬季奥林匹克运动会——冬奥会", " 航空母舰—— 航母"],
      correctAnswer: 1
    },
    {
      question: "中国气候的特点是_________，属于大陆性季风气候。",
      options: [" 北暖南寒", " 南暖北寒", " 东暖西寒", " 西暖冬寒"],
      correctAnswer: 1
    },
    {
      question: "下列汉字中，不属于象形字的是_________",
      options: [" 马", " 月", " 山", " 上"],
      correctAnswer: 3
    },
    {
      question: "下列汉字字义为“水大的样子”的是_________",
      options: [" 淼", " 森", " 磊", " 众"],
      correctAnswer: 0
    },
    {
      question: "“月”在汉字左边或下边多表示与人或人体器官（包括动物）有关，在右边则多表示时间与天气。“脸”、“脑”、“腿”、“脚”这些字都_________",
      options: [" 与身体有关", " 跟时间有关", " 跟天气有关", " 跟动物有关"],
      correctAnswer: 0
    },
    {
      question: "柴达木盆地，位于青海省西北部，不仅是盐的世界，而且还有丰富的石油、煤以及多种金属矿藏，所以有“_________”的美称。",
      options: [" 中国粮仓", " 天府之国", " 鱼米之乡", " 聚宝盆"],
      correctAnswer: 3
    },
    {
      question: "紫荆花是中国香港的市花，象征着繁华与昌盛，澳门的市花是_________，有纯洁清廉之意。",
      options: [" 牡丹", " 玫瑰", " 莲花", " 菊花"],
      correctAnswer: 2
    },
    {
      question: "兰新高铁横贯中国西北地区甘肃、青海和新疆三省区，被誉为“钢铁丝绸之路”。2014年11月，_________至哈密段正式通车，标志着新疆进入了高铁时代。",
      options: [" 长春", " 吉林", " 乌鲁木齐", " 呼和浩特"],
      correctAnswer: 2
    },
    {
      question: "刘慈欣的科幻小说_________讲述了地球人类文明与外星文明的信息交流和兴衰历程。",
      options: ["《三体》", "《流浪地球》", "《超新星纪元》", "《球状闪电》"],
      correctAnswer: 0
    },
    {
      question: "中国的地方戏丰富多彩，而且大多数地方戏都有自己的代表剧目。人们熟悉的《梁山伯与祝英台》是_________代表剧目。",
      options: [" 评剧", " 越剧", " 粤剧", " 豫剧"],
      correctAnswer: 1
    },
    {
      question: "“你是一束一束的花开，是燕在梁间呢喃。——你是爱，是暖，是希望，你是人间的四月天!”出自林徽因的《你是人间的四月天》，此诗是林徽因为其___________而作。",
      options: [" 儿子", " 爱人", " 挚友", " 母亲"],
      correctAnswer: 0
    },
    {
      question: "_________是中国古代的一种打击乐器，由青铜制成。演员演奏时用小木锤或长型的棒敲打，声音清脆响亮，优美动听。",
      options: [" 琵琶", " 箜篌", " 编钟", " 胡琴"],
      correctAnswer: 2
    }
    {
        question: "在广西壮族自治区，有一项最具代表性的民族手工艺品，这种工艺品叫_________，一般用棉线或丝线编织而成，图案生动，色彩斑斓，充满热烈、开朗的民族格调，体现了壮族人民对天地的崇拜和对美好生活的追求与向往。",
        options: [" 云锦", " 壮锦", " 蜀锦", " 宋锦"],
        correctAnswer: 1
      },
      {
        question: "中国茶分红、绿、青、黄、黑、白六大类，普洱茶属于_________。",
        options: [" 绿茶", " 黑茶", " 红茶", " 黄茶"],
        correctAnswer: 1
      },
      {
        question: "陆上丝绸之路的_________“丝绸之路：长安-天山廊道路网”于2014年6月成功申报为世界文化遗产，该项目是由中国、哈萨克斯坦和吉尔吉斯斯坦联合申报的，是首例跨国合作而成功申遗的项目。",
        options: [" 南段", " 西段", " 北段", " 东段"],
        correctAnswer: 3
      },
      {
        question: "壮族绣球是广西极具特色的民间吉祥物。在春播时节，广西靖西人会在里面放五谷种子，意味着期盼_________。",
        options: [" 生育兴旺", " 延年益寿", " 五谷丰登", " 风调雨顺"],
        correctAnswer: 2
      },
      {
        question: "北宋画家______的《清明上河图》生动地描绘了北宋都城汴梁（今开封）商业活动的繁荣景象，是中国古代绘画的杰作。",
        options: [" 张择端", " 顾恺之", " 曹仲达", " 张僧繇"],
        correctAnswer: 0
      },
      {
        question: "唢呐是一种民间吹管乐器，公元3世纪由_________传入中国。",
        options: [" 朝鲜", " 印度", " 波斯", " 日本"],
        correctAnswer: 2
      },
      {
        question: "_________是当今世界上现存最早、保存最完整的古代敞肩石拱桥，位于河北省石家庄市赵县。",
        options: [" 卢沟桥", " 宝带桥", " 洛阳桥", " 赵州桥"],
        correctAnswer: 3
      },
      {
        question: "古人纪时用地支表示十二个时辰，每个时辰相当于两小时，并按照“子、丑、寅、卯……”等顺序为每一个时辰命名。请问“午时”相当于现在的哪一个时间段？_________",
        options: [" 23-1时", " 7-9时", " 11-13时", " 19-21时"],
        correctAnswer: 2
      },
      {
        question: "_________四点半，我们就看见他急急忙忙_________跑出办公室下班了。",
        options: [" 就、地", " 刚、得", " 才、地", " 一、就"],
        correctAnswer: 2
      },
      {
        question: "下了一夜的雨，我早上出门上学，觉得_________。",
        options: [" 有点儿冷", " 一点儿冷", " 冷一点儿", " 冷有点儿"],
        correctAnswer: 0
      },
      {
        question: "你说了这么多，可我真的一点儿都_________！",
        options: [" 听没懂", " 听懂没", " 没听懂", " 不听懂"],
        correctAnswer: 2
      },
      {
        question: "这么简单的对话，对于我这个学了四年中文的人来说，真是_________一碟！",
        options: [" 小意思", " 小麻烦", " 小菜", " 凉菜"],
        correctAnswer: 2
      },
      {
        question: "中国位_________太平洋西岸，亚欧大陆的东部。",
        options: [" 为", " 于", " 在", " 有"],
        correctAnswer: 1
      },
      {
        question: "“她今天到底能不能来上课啊？”这句话中，“到底”可以被下列哪个词替换？",
        options: [" 怎么", " 居然", " 竟然", " 究竟"],
        correctAnswer: 3
      },
      {
        question: "您千万_________客气，这都是我应该做的。",
        options: [" 非", " 没", " 不", " 别"],
        correctAnswer: 3
      }
  ];
  